{
	"@metadata": {
		"authors": [
			"Abijeet Patro",
			"Jeblad",
			"Jhertel",
			"Liuxinyu970226",
			"MuratTheTurkish",
			"Raymond",
			"Umherirrender",
			"Verdy p"
		]
	},
	"pickle-desc": "{{pickle-gloss}} {{desc|name=Pickle|url=https://www.mediawiki.org/wiki/Extension:Pickle }}",
	"pickle-testspec-subpage": "{{Notranslate}}\n{{pickle-gloss}}\nUsed while creating a link to the subpage holding the test code. This is the version used for pickle-style tests.",
	"pickle-testspec-invoke": "{{Notranslate}}\n{{pickle-gloss}}\nUsed while invoking the module on the subpage holding the test code. This is the version used for pickle-style tests.",
	"pickle-testcase-subpage": "{{Optional}}\n{{pickle-gloss}}\nUsed while creating a link to the subpage holding the test code. This is the version used for testcase-style tests.",
	"pickle-testcase-invoke": "{{Optional}}\n{{pickle-gloss}}\nUsed while invoking the module on the subpage holding the test code. This is the version used for testcase-style tests.",
	"pickle-default-subpage": "{{Optional}}\n{{pickle-gloss}}\nUsed while creating a link to the subpage holding the test code. This is the version used for default tests, that is the catch all.",
	"pickle-default-invoke": "{{Optional}}\n{{pickle-gloss}}\nUsed while invoking the module on the subpage holding the test code. This is the version used for default tests, that is the catch all.",
	"pickle-function-text-good": "{{pickle-gloss|pass}} {{pickle-function-desc|pass}} A passed result is one where all reported tests were ok.",
	"pickle-function-text-pending": "{{pickle-gloss}} {{pickle-function-desc|pending}} A pending result is one where one or more reported tests were pending.",
	"pickle-function-text-fail": "{{pickle-gloss|fail}} {{pickle-function-desc|fail}} A failed result is one where one or more reported tests were not ok.",
	"pickle-function-text-missing": "{{pickle-gloss}} {{pickle-function-desc|missing}} A missing result is one where the test page could not be found.",
	"pickle-function-text-unknown": "{{pickle-gloss}} {{pickle-function-desc|unknown}} An unknown result is one where the reported tests could not be parsed.",
	"pickle-function-text-invalid": "{{pickle-gloss}} {{pickle-function-desc|invalid}} An invalid result is one where the provided configuration or reported tests could not be parsed. This is only used for the parser function.",
	"pickle-function-text-todo-good": "{{pickle-gloss|pass}} {{pickle-function-desc|pass}} A passed (but still pending) result, is one where all reported tests marked \"todo\" were ok. The todo-part signals that the tests are incompletes, but can continue, and the pass-part that the tests so far was successfull.",
	"pickle-function-text-todo-fail": "{{pickle-gloss|fail}} {{pickle-function-desc|fail}} A failed (but still pending) result, is one where one or more reported tests marked \"todo\" were not ok. The todo-part signals that the tests are incomplete, but can continue, and the fail-part that the tests so far was unsuccessfull.",
	"pickle-function-text-skip-good": "{{pickle-gloss|pass}} {{pickle-function-desc|pass}} A passed (but still pending) result, is one where all reported tests marked \"skip\" were ok. The skip-part signals that the tests are incomplete, but must abort, and the pass-part that the tests so far was successfull.",
	"pickle-function-text-skip-fail": "{{pickle-gloss|fail}} {{pickle-function-desc|fail}} A failed (but still pending) result, is one where one or more reported tests marked \"skip\" were not ok. The skip-part signals that the tests are incomplete, but must abort, and the fail-part that the tests so far was unsuccessfull.",
	"pickle-test-text-good": "{{pickle-gloss|pass}} {{pickle-indicator-desc|pass}} A passed result is one where all reported tests were ok.\n{{Identical|Pass}}",
	"pickle-test-text-pending": "{{pickle-gloss}} {{pickle-indicator-desc|pending}} A pending result is one where one or more reported tests were pending.\n{{Identical|Pending}}",
	"pickle-test-text-fail": "{{pickle-gloss|fail}} {{pickle-indicator-desc|fail}} A failed result is one where one or more reported tests were not ok.\n{{Identical|Failed}}",
	"pickle-test-text-missing": "{{pickle-gloss}} {{pickle-indicator-desc|missing}} A missing result is one where the test page could not be found.\n{{Identical|Missing}}",
	"pickle-test-text-unknown": "{{pickle-gloss}} {{pickle-indicator-desc|unknown}} An unknown result is one where the reported tests could not be parsed.\n{{Identical|Unknown}}",
	"pickle-test-text-invalid": "{{pickle-gloss}} {{pickle-indicator-desc|invalid}} An invalid result is one where the provided configuration or reported tests could not be parsed. This is only used for the parser function.\n{{Identical|Invalid}}",
	"pickle-test-text-todo-good": "{{pickle-gloss|pass}} {{pickle-indicator-desc|pass}} A passed (but still pending) result, is one where all reported tests marked \"todo\" were ok. The todo-part signals that the tests are incompletes, but can continue, and the pass-part that the tests so far was successfull.",
	"pickle-test-text-todo-fail": "{{pickle-gloss|fail}} {{pickle-indicator-desc|fail}} A failed (but still pending) result, is one where one or more reported tests marked \"todo\" were not ok. The todo-part signals that the tests are incomplete, but can continue, and the fail-part that the tests so far was unsuccessfull.",
	"pickle-test-text-skip-good": "{{pickle-gloss|pass}} {{pickle-indicator-desc|pass}} A passed (but still pending) result, is one where all reported tests marked \"skip\" were ok. The skip-part signals that the tests are incomplete, but must abort, and the pass-part that the tests so far was successfull.",
	"pickle-test-text-skip-fail": "{{pickle-gloss|fail}} {{pickle-indicator-desc|fail}} A failed (but still pending) result, is one where one or more reported tests marked \"skip\" were not ok. The skip-part signals that the tests are incomplete, but must abort, and the fail-part that the tests so far was unsuccessfull.",
	"pickle-tracking-category-good": "{{pickle-gloss|pass}} {{pickle-category-desc|good}}",
	"pickle-tracking-category-good-desc": "{{pickle-gloss|pass}} {{doc-tracking-category-desc}}",
	"pickle-tracking-category-pending": "{{pickle-gloss}} {{pickle-category-desc|pending}}",
	"pickle-tracking-category-pending-desc": "{{pickle-gloss}} {{doc-tracking-category-desc}}",
	"pickle-tracking-category-todo": "{{pickle-gloss}} {{pickle-category-desc|todo}}",
	"pickle-tracking-category-todo-desc": "{{pickle-gloss}} {{doc-tracking-category-desc}}",
	"pickle-tracking-category-skip": "{{pickle-gloss}} {{pickle-category-desc|skip}}",
	"pickle-tracking-category-skip-desc": "{{pickle-gloss}} {{doc-tracking-category-desc}}",
	"pickle-tracking-category-fail": "{{pickle-gloss|fail}} {{pickle-category-desc|fail}}",
	"pickle-tracking-category-fail-desc": "{{pickle-gloss|fail}} {{doc-tracking-category-desc}}",
	"pickle-tracking-category-missing": "{{pickle-gloss}} {{pickle-category-desc|missing}}",
	"pickle-tracking-category-missing-desc": "{{pickle-gloss}} {{doc-tracking-category-desc}}",
	"pickle-tracking-category-unknown": "{{pickle-gloss}} {{pickle-category-desc|unknown}}",
	"pickle-tracking-category-unknown-desc": "{{pickle-gloss}} {{doc-tracking-category-desc}}",
	"pickle-track-log-name": "{{pickle-gloss}} {{doc-logpage}}",
	"pickle-track-log-header": "{{pickle-gloss}} Description used on top of Special:log when filtered on this specific log.",
	"pickle-track-log-entry-good": "{{pickle-gloss|pass}} This is used when the subpage exists, and the result is found to have passed according to the TAP-format.\n\n{{logentry}}",
	"pickle-track-log-entry-todo-good": "{{pickle-gloss|pass}} This is used when the subpage exists, and the result is found to have passed according to the TAP-format, but the result is also marked as \"todo\".\n\n{{logentry}}",
	"pickle-track-log-entry-todo-fail": "{{pickle-gloss|fail}} This is used when the subpage exists, and the result is found to have failed according to the TAP-format, but the result is also marked as \"todo\".\n\n{{logentry}}",
	"pickle-track-log-entry-skip-good": "{{pickle-gloss|pass}} This is used when the subpage exists, and the result is found to have passed according to the TAP-format, but the result is also marked as \"skip\".\n\n{{logentry}}",
	"pickle-track-log-entry-skip-fail": "{{pickle-gloss|fail}} This is used when the subpage exists, and the result is found to have failed according to the TAP-format, but the result is also marked as \"skip\".\n\n{{logentry}}",
	"pickle-track-log-entry-fail": "{{pickle-gloss|fail}} This is used when the subpage exists, and the result is found to have failed according to the TAP-format.\n\n{{logentry}}",
	"pickle-track-log-entry-exists": "{{pickle-gloss}} This is used when the subpage exists, but the result is something else than a valid TAP-format.\n\n{{logentry}}",
	"pickle-track-log-entry-missing": "{{pickle-gloss}} This is used when the subpage does not exists.\n\n{{logentry}}",
	"pickle-track-log-entry-unknown": "{{pickle-gloss}} This is used when the subpage exists, and the result can't be established in any known way.\n\n{{logentry}}",
	"pickle-console-title": "{{pickle-gloss}} Area used for test reports. Can be empty, but will then have a message about this.",
	"pickle-console-empty": "{{pickle-gloss}} Message used to clarify that the output area is initially empty. It is injected into the test console as a placeholder for the later test output.",
	"pickle-console-cleared": "{{pickle-gloss}} Message used to clarify that the output area is cleared. It is injected into the test console as a placeholder for the cleared test output.",
	"pickle-console-run": "{{pickle-gloss}} Button to initiate a run of a test case. After the completed run the report will be appended to the output area.\n{{Identical|Run}}",
	"pickle-console-clear": "{{pickle-gloss}} Button to initiate a clearing of previous test cases. After clearing the output area a message to the effect will be injected.\n{{Identical|Clear}}",
	"pickle-report-skip-no-message": "{{pickle-gloss}} [Note for dev; delete entry?] Error message for non-existing message keys. Indicates a missing or wrong implementation, possibly on some kind of extension.",
	"pickle-case-compact-header-all-good": "{{pickle-gloss|pass}} [Note for dev; delete entry?] Header message used for the compact layout when all contained constituents are passed. Initial \"ok\" must be retained, but can be followed by an explanation. {{pickle-report-compact}}\n{{Identical|OK}}",
	"pickle-case-compact-header-some-failed": "{{pickle-gloss}} [Note for dev; delete entry?] Header message used for the compact layout when some contained constituents have failed. Initial \"not ok\" must be retained, but can be followed by an explanation. {{pickle-report-compact}}",
	"pickle-case-full-header": "{{pickle-gloss}} [Note for dev; delete entry?] Header message used for the full layout. Initial hash (#) must be retained. {{pickle-report-full}}",
	"pickle-case-vivid-header": "{{pickle-gloss}} [Note for dev; delete entry?] Header message used for the full layout. {{pickle-report-vivid}}",
	"pickle-case-no-description": "{{pickle-gloss}} The string used for the test case header when the tests provides none. The string should not be on a form that can trigger an extractor.\n{{Identical|Anonymous}}",
	"pickle-case-no-fixtures": "{{pickle-gloss}} The tests has provided no fixtures, that is the function that should contain the tests has none. This will be marked as an \"todo\".",
	"pickle-case-no-tests": "{{pickle-gloss}} The tests has run no tests, that is the functions for the fixtures has no tests. This will be marked as an \"todo\".",
	"pickle-report-case-xtop-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"xtop\" used for silenced tests at outher level in assessments. If \"xtop\" is translated, then \"top\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-xtop-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the xtop test case level.",
	"pickle-report-case-xdescribe-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"xdescribe\" used for silenced tests at outher level in assessments. If \"xdescribe\" is translated, then \"describe\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-xdescribe-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the xdescribe test case level.",
	"pickle-report-case-xcontext-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"xcontext\" used for silenced tests at intermediate level in assessments. If \"xcontext\" is translated, then \"context\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-xcontext-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the xcontext test case level.",
	"pickle-report-case-xit-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"xit\" used for silenced tests at inner level in assessments. If \"xit\" is translated, then \"it\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-xit-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the xit test case level.",
	"pickle-report-case-top-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"top\" used for silenced tests at outher level in assessments. If \"top\" is translated, then \"xtop\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-top-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the top test case level.",
	"pickle-report-case-describe-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"describe\" used for silenced tests at outher level in assessments. If \"describe\" is translated, then \"xdescribe\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-describe-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the describe test case level.",
	"pickle-report-case-context-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"context\" used for tests at intermediate level in assessments. If \"context\" is translated, then \"xcontext\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-context-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the context test case level.",
	"pickle-report-case-it-keyword": "{{pickle-gloss|describe-context-it}} Initial keyword \"it\" used for silenced tests at inner level in assessments. If \"it\" is translated, then \"xit\" should probably be translated too. The <em>English</em> version of this keyword should not be changed. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-it-no-description": "{{Optional}}\n{{pickle-gloss|describe-context-it}} The default message when the optional description string is missing for the it test case level.",
	"pickle-report-case-is-ok-keyword": "{{pickle-gloss|pass}} Initial keyword \"ok\" used for each passed test case in a TAP-report. If \"ok\" is translated, then \"not ok\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-is-not-ok-keyword": "{{pickle-gloss|fail}} Initial keyword \"not ok\" used for each failed test case in a TAP-report. If \"not ok\" is translated, then \"ok\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for <em>other languages</em>, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-case-is-skip-keyword": "{{pickle-gloss|skip}} Keyword \"skip\" used for each skipped test case in a TAP-report. If \"skip\" is translated, then \"todo\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.\n{{Identical|Skip}}",
	"pickle-report-case-is-todo-keyword": "{{pickle-gloss|todo}} Keyword \"todo\" used for each incomplete test case in a TAP-report. If \"todo\" is translated, then \"skip\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.\n{{Identical|Todo}}",
	"pickle-report-case-todo-no-description": "{{Optional}}\n{{pickle-gloss|todo}} The default message when the optional description string is missing for the todo at test case level.",
	"pickle-report-case-skip-no-description": "{{Optional}}\n{{pickle-gloss|skip}} The default message when the optional description string is missing for the skip at test case level.",
	"pickle-report-adapt-is-ok-keyword": "{{pickle-gloss|pass}} Initial keyword \"ok\" used for each passed test at adapt level in a TAP-report. If \"ok\" is translated, then \"not ok\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-adapt-is-not-ok-keyword": "{{pickle-gloss|fail}} Initial keyword \"not ok\" used for each failed test at adapt level in a TAP-report. If \"not ok\" is translated, then \"ok\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for <em>other languages</em>, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-adapt-is-skip-keyword": "{{pickle-gloss|skip}} Keyword \"skip\" used for each skipped test at adapt level in a TAP-report.  If \"skip\" is translated, then \"todo\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-adapt-is-todo-keyword": "{{pickle-gloss|todo}} Keyword \"todo\" used for each incomplete test at adapt level in a TAP-report. If \"todo\" is translated, then \"skip\" should probably be translated too. The <em>English</em> version of this keyword should not be changed as it will make the parsing fail. The <em>English</em> version is the source language, so it can't be changed unless done at the repo. If translated for other languages, then the translation will be wrapped in parethesis and appended to the English keyword.",
	"pickle-report-adapt-todo-no-description": "{{Optional}}\n{{pickle-gloss}} The default message when the optional description string is missing for the todo at adapt level.",
	"pickle-report-adapt-skip-no-description": "{{Optional}}\n{{pickle-gloss}} The default message when the optional description string is missing for the skip at adapt level.",
	"pickle-adapt-process-first": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|1|first}}",
	"pickle-adapt-process-second": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|2|second}}",
	"pickle-adapt-process-third": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|3|third}}",
	"pickle-adapt-process-fourth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|4|fourth}}",
	"pickle-adapt-process-fifth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|5|fifth}}",
	"pickle-adapt-process-sixth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|6|sixth}}",
	"pickle-adapt-process-seventh": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|7|seventh}}",
	"pickle-adapt-process-eighth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|8|eighth}}",
	"pickle-adapt-process-ninth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|9|ninth}}",
	"pickle-adapt-process-tenth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|10|tenth}}",
	"pickle-adapt-process-eleventh": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|11|eleventh}}",
	"pickle-adapt-process-twelfth": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-pick-element|12|twelfth}}",
	"pickle-adapt-process-as-type": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-upper": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-string-format|upper}}",
	"pickle-adapt-process-as-lower": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-string-format|lower}}",
	"pickle-adapt-process-as-upper-first": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-string-format|upper first}}",
	"pickle-adapt-process-as-lower-first": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-string-format|upper first}}",
	"pickle-adapt-process-as-reverse": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-u-upper": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-ustring-format|upper}}",
	"pickle-adapt-process-as-u-lower": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-ustring-format|lower}}",
	"pickle-adapt-process-as-u-upper-first": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-ustring-format|upper}}",
	"pickle-adapt-process-as-u-lower-first": "{{pickle-gloss}} {{pickle-preprocess}} {{pickle-ustring-format|lower}}",
	"pickle-adapt-process-as-u-n-f-c": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-u-n-f-d": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-number": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-string": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-floor": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-ceil": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-round": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-integer": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-process-as-fraction": "{{pickle-gloss}} {{pickle-preprocess}}",
	"pickle-adapt-condition-to-be-equal": "{{pickle-gloss}} {{pickle-condition}} This test is a plain equality.",
	"pickle-adapt-condition-to-be-boolean-equal": "{{pickle-gloss}} {{pickle-condition}} This test transforms each value to its boolean counterpart before comparison.",
	"pickle-adapt-condition-to-be-strict-equal": "{{pickle-gloss}} {{pickle-condition}} This tests both the plain values and the type, so to block false positives due to type coersion.",
	"pickle-adapt-condition-to-be-same": "{{pickle-gloss}} {{pickle-condition}} This tests the plain values after type coersion.",
	"pickle-adapt-condition-to-be-deep-equal": "{{pickle-gloss}} {{pickle-condition}} This tests all the plain values in a table, recursing deep into the object.",
	"pickle-adapt-condition-to-be-contained": "{{pickle-gloss}} {{pickle-condition}} The plain value shall be contained within than the target value, given as a table.",
	"pickle-adapt-condition-to-be-lesser-than": "{{pickle-gloss}} {{pickle-condition}} The plain value shall be exclusively smaller than the target value.",
	"pickle-adapt-condition-to-be-greater-than": "{{pickle-gloss}} {{pickle-condition}} The plain value shall be exclusively greater than the target value.",
	"pickle-adapt-condition-to-be-lesser-or-equal": "{{pickle-gloss}} {{pickle-condition}} The plain value shall be inclusively smaller than the target value.",
	"pickle-adapt-condition-to-be-greater-or-equal": "{{pickle-gloss}} {{pickle-condition}} The plain value shall be inclusively greater than the target value.",
	"pickle-adapt-condition-to-be-match": "{{pickle-gloss}} {{pickle-condition}} The plain value as a string shall be a part of the target value, given as a string.",
	"pickle-adapt-condition-to-be-u-match": "{{pickle-gloss}} {{pickle-condition}} The plain value as an unicode string shall be a part of the target value, given as an unicode string.",
	"pickle-adapt-catched-exception": "{{pickle-gloss}} An exception has been catched during evaluation of a fixture. This can be due to assertions and spies, but can also be because of errors and other abrubt terminations.",
	"pickle-adapt-catched-return": "{{pickle-gloss}} A return value has beed been catched from evaluation of a fixture. This is a planned early return, and will often carry a result.",
	"pickle-spies-carp-todo": "{{pickle-gloss}} {{pickle-spies-called|carp}}",
	"pickle-spies-cluck-todo": "{{pickle-gloss}} {{pickle-spies-called|cluck}}",
	"pickle-spies-confess-skip": "{{pickle-gloss}} {{pickle-spies-called|confess}}",
	"pickle-spies-croak-skip": "{{pickle-gloss}} {{pickle-spies-called|croak}}",
	"pickle-spies-confess-exits": "{{pickle-gloss}} {{pickle-spies-exits|confess}}",
	"pickle-spies-croak-exits": "{{pickle-gloss}} {{pickle-spies-exits|croak}}",
	"pickle-stub-no-fallback": "{{pickle-gloss}} Tried to conditionally execute a on-empty fallback, and could not find any such function.",
	"pickle-stub-no-more-frames": "{{pickle-gloss}} A value was requested, but previous executions has reached end of precomputed values."
}
